Repository: FiraolLemma/poultry
Catalog: */locale/om/LC_MESSAGES/django.po
Languages: om

source: About Us
om: Waa'ee keenya

source: We are a company dedicated to providing the best services to our customers.
om: Kompaanii tajaajila gaarii kan gaafatamaa keenyaaf kennuudha.

source: Ethiopian poultry marketplace - Buy and sell poultry products in Ethiopia
om: Gabaa horsiisa lukkuu Itoophiyaa - Oomisha horsiisa lukkuu bitaa fi gurguru

source: EthioPoultry - Ethiopian Poultry Marketplace
om: EthioPoultry - Gabaa Horsiisa Lukkuu Itoophiyaa

source: Skip to main content
om: Gara ogummaa guddaa seenuu

source: Home
om: Mana

source: Main navigation
om: Garaagarummaa guddaa

source: Marketplace
om: Gabaa

source: Sell Products
om: Oomisha Gurguruu

source: Messages
om: Ergaa

source: Contact Us
om: Nu qunnamaa

source: Select language
om: Afaan filadhu

source: User menu
om: Menyuu fayyadamaa

source: Profile picture
om: Suuraa piroofaayilaa

source: My Profile
om: Piroofaayila koo

source: Settings
om: Saagiidha

source: Logout
om: Baʼuu

source: Login
om: Seenuu

source: Register
om: Galmaaʼuu

source: Toggle navigation
om: Garaagarummaa jijjiiraa

source: Quick Links
om: Lakkoofsa dhiyeessaa

source: Help & Support
om: Gargaarsa & Deeggarsa

source: FAQs
om: Gaaffilee Faakkii

source: Privacy Policy
om: Seera Iccitii

source: Terms of Service
om: Seerluga Tajaajilaa

source: Connect With Us
om: Nu Waliin Walquunnamaa

source: Feedback
om: Yaada Deebii

source: Phone Number
om: Lakkoofsa Bilbila

source: Your Message
om: Ergaa kee

source: Send
om: Ergaa

source: All rights reserved.
om: Mirga hundi kan ofii.

source: Designed by
om: Akkaataa ittiin ijaarame

source: Empowering Ethiopia's Poultry Farmers with Fairness & Growth
om: Horsiistota Lukkuu Itoophiyaa Cimsuu fi Guddina Waliin

source: Connecting Ethiopian poultry farmers with buyers nationwide
om: Horsiistota lukkuu Itoophiyaa daldaltoota biyya guutuu waliin walqunnamsiisuu

source: Browse Marketplace
om: Gabaa daawwadhu

source: Companies We Work With
om: Kompaanota Waliin Hojjanna

source: Our Impact So Far
om: Dhiibbaa Keenya Ammaatti

source: Total Users
om: Fayyadamtoota Waliigalaa

source: Active Users
om: Fayyadamtoota Hojii Irraa Jiru

source: Items for Sale
om: Wantoota Gurgurtaa

source: Conversations Started
om: Haasawaawan Jalqabame

source: Join a growing community of Ethiopian poultry farmers, buyers, and experts. List your products, connect with partners, and start meaningful conversations today!
om: Horsiistota lukkuu Itoophiyaa, daldaltoota, fi ogeesota wajjin walquunamaa. Oomisha keessan galmeessaa, hirmaattoota wajjin walqunnamtii godhaa, haasawa barbaachisaa ta'e har'a jalqabaa!

source: Why We Built This Platform?
om: Maaliif Platformii Kana Ijaarree?

source: Stop Price Shocks, Grow with Confidence
om: Dhibbaa Gatii Dhabamsiisuun, Amansiisaan Nagadaa

source: Did you know? 40%% of small poultry farmers lose profits due to unpredictable price swings. We're changing that.
om: Beektaa? 40%% horsiistonni lukkuu xixiqqaan galii isaanii gatii hin beekkamin irraa dhabu. Kana jijjiiruudhaaf hojjana.

source: → Real-time pricing + expert tips = steadier income for YOU.
om: → Gatii yeroo dhugaa + gorsa ogartootaa = galii madaalawaa isiniif.

source: Connect Directly—No More Middlemen!
om: Dallaalaa Malee Walquunamaa!

source: Over 70%% of farmers struggle to find fair buyers. We link you directly to trusted traders, suppliers, and experts—cutting costs, boosting profits.
om: Horsiistotni 70%% ol daldaltoota sirrii argachuuf rakkatu. Daldaltoota amanamoo, oomishaa fi ogeessota walquunamsiisaa galii keessan dablla.

source: Transparent Markets = Stronger Farmers
om: Gabaabummaa Gabaa = Horsiistota Cimaa

source: Rumors of 'shortages' hurt small farms. Truth: Ethiopia produces 300M+ eggs/year—enough for all! We expose manipulation and highlight REAL data.
om: Oduun 'hanqinni gabbaa jira' jedhaa jiru. Dhugaan: Itoophiyaan kiillee 300M+ kiillee/waggaan—hundaaf gahaa! Sochii jijjiiramaa agarsiisaa fi daataa DHUGAA guddisna.

source: Messages Received
om: Ergaa Dhufan

source: No messages yet.
om: Ergaa hin jiru ammaatti.
